multiSpeciesMassTransportLibrary/testCase/rhoReactingFoam_diffusion_hConst/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    left
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    right
    {
        type            zeroGradient;
        value           uniform 0.0;
    }
    wall
    {
        type            zeroGradient;
        inletValue      uniform 0;
        value           uniform 0;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
